package com.javarush.test.level03.lesson12.home02;

/* Я не хочу изучать Java, я хочу большую зарплату
Вывести на экран десять раз надпись «Я не хочу изучать Java, я хочу большую зарплату»
*/

public class Solution
{
    public static void main(String[] args)
    {
        int i = 1;
        while (i<=10)
        {
          System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
            i = i+1;
        }//напишите тут ваш код
    }
}
